      **********************************
      * INDEXED SUPPLIER FILE STRUCTURE - SUPPLIERI.TXT
      **********************************
           05  SUPPLIER-CODE-OUT-PK  PIC X(5).
           05  SUPPLIER-NAME-OUT PIC X(15).