      **********************************
      * INDEXED INVENTORY FILE STRUCTURE - INVENT6.TXT
      **********************************
           05 PART-NUMBER-IN-PK        PIC 9(5).
           05 PART-NAME                PIC X(20).
           05 QTY-ON-HAND              PIC 9(3).
           05 UNIT-PRICE-IN            PIC 9(4).
           05 SUPPLIER-CODE-IN-FK      PIC 9(5).
           05 RE-ORDER-POINT-IN        PIC 9(3).
      


