      ******************************************************************
      * SUPPLIER FILE STRUCTURE - INVENT.TXT                           *
      ******************************************************************
           05 PART-NUMBER-IN    PIC 9(5).
           05 PART-NAME-IN      PIC X(20).
           05 QTY-ON-HAND-IN    PIC 9(3).
           05 UNIT-PRICE-IN     PIC 9(2)V99.
           05 SUPPLIER-CODE-IN  PIC 9(5).
           05 RE-ORDER-POINT-IN PIC 9(3).
       

