      ******************************************************************
      * SUPPLIER FILE STRUCTURE - SUPPLIERS4.TXT                       *
      ******************************************************************
           05  SUPPLIER-CODE  PIC X(5).
           05  SUPPLIER-NAME  PIC X(15).


